########################################################################################################################
# TODO арифметические операторы

import math

print(10 + 10)  # сложение
print(10 - 11)  # вычитание

print(10 * 10)  # умножение
print(10 / 10)  # деление
print(15 // 10)  # целочисленное деление (отбрасывает дробную часть)

print(12 % 5)  # остаток от деления 12 / 5 = 5 + 5 + 2      2
print(200 % 2)  # чётный/нечётный
print(9 % 2 == 0)  # проверка числа на чётность
print(9 % 2 != 0)  # проверка числа на нечётность

print(2 ** 5)  # возведение в степень
print(5 ** 2)  # возведение в степень
print(81 ** 0.5)  # извлечение из-под корня

print(int(math.sqrt(16)))  # извлечение из-под корня с помощью библиотеки
print(math.exp(2))  # ... другие математические операции

print(15 < 4)  # меньше
print(15 > 4)  # больше
print(15 == 4)  # равно
print(15 != 4)  # не равно
print(15 <= 4)  # меньше или равно
print(15 >= 4)  # больше или равно

########################################################################################################################

########################################################################################################################
# TODO сокращённые операторы

seconds = 0
seconds = seconds + 1
print(seconds)
seconds += 5  # increment | seconds + 1
# seconds += float(input("__"))  # increment | seconds + 1
print(seconds)  # 6

seconds = seconds - 1
seconds -= 1  # decrement

seconds = seconds * 2
seconds *= 2  # multiply
# ...

########################################################################################################################

########################################################################################################################
# TODO оператор принадлежности (in) и сравнения (is)

# in
list1 = [1, 2]
val1 = 3
cond3 = val1 in list1  # False
print(cond3)

str1 = "Python"
chr1 = "P"
chr2 = "p"
print(chr1 in str1)
print(chr2 in str1)

# is
x = 5
y = 5
print(x is y)

########################################################################################################################
